2018/python-build-in-type.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-03-12 周二 13:44 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Python 内置类型</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Python 内置类型</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgac398a0">1. 简介</a></li>
<li><a href="#org83bc4c8">2. bool</a></li>
<li><a href="#org8017e73">3. 数值类型</a>
<ul>
<li><a href="#org0cbf2d1">3.1. 方法</a></li>
</ul>
</li>
<li><a href="#orgcaa0aa8">4. 序列类型</a></li>
<li><a href="#org84934f7">5. 文本序列类型</a></li>
<li><a href="#org039ba22">6. 集合类型</a></li>
<li><a href="#org3188c10">7. 映射类型</a></li>
<li><a href="#orge0d85d8">8. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgac398a0" class="outline-2">
<h2 id="orgac398a0"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
这篇博客是对 <code>Python</code> 内置类型的简单汇总， 省略了很多内容。
</p>
</div>
</div>

<div id="outline-container-org83bc4c8" class="outline-2">
<h2 id="org83bc4c8"><span class="section-number-2">2</span> bool</h2>
<div class="outline-text-2" id="text-2">
<p>
<code>Python</code> 中， <code>bool</code> 类型属于 <code>int</code> 的子类， 只存在 <code>True</code> 和 <code>False</code> 这两个实例。
</p>

<p>
<code>Python2</code> 中可以对 <code>True</code> 或 <code>False</code> 赋值搞出 <code>True = False</code> 的操作， 这一点在 <code>Python3</code> 中得到
了修改。
</p>

<p>
知道在什么情况下 <code>bool</code> 判断为 <code>False</code> 是很有用的：
</p>
<ul class="org-ul">
<li><code>None</code></li>
<li><code>False</code></li>
<li>任何数值类型的零</li>
<li>任何空序列</li>
<li>任何空映射</li>
</ul>

<p>
对于比较操作符， 我觉得需要注意的是： <code>is not</code>.
</p>

<p>
初学的时候， 经常写成 <code>not is</code> 出错。
</p>
</div>
</div>

<div id="outline-container-org8017e73" class="outline-2">
<h2 id="org8017e73"><span class="section-number-2">3</span> 数值类型</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>Python</code> 的数值类型有 <code>int</code>, <code>float</code>, <code>complex</code>. 其中， <code>complex</code> 是复数， <code>Python</code> 默认就支持
复数运算。 另外， <code>Python2</code> 还有一个 <code>long</code> 类型。
</p>

<p>
对于数值类型， 有一些通用的操作， 如 <code>+</code>, <code>-</code>, <code>*</code>, <code>/</code> 等。
</p>

<p>
详细了解可以看一下文档： <a href="https://docs.python.org/3/library/stdtypes.html#numeric-types-int-float-complex">Numeric Types — int, float, complex</a>
</p>

<p>
这里列举出需要注意的一点：
</p>
<ul class="org-ul">
<li><p>
除法 <code>/</code>: <code>Python2</code> 中的除法默认是地板除， 而在 <code>Python3</code> 中地板除是 <code>//</code>. 当然， <code>Python2</code>
中也可以使用 <code>//</code>, 但是这和 <code>/</code> 没有区别。 如果想要 <code>Python2</code> 中的除法和 <code>Python3</code> 中的
行为保持一致， 可以：
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> __future__ <span class="org-keyword">import</span> division
</pre>
</div></li>
</ul>

<p>
另外， <code>int</code> 类型是支持位运算的。
</p>
</div>

<div id="outline-container-org0cbf2d1" class="outline-3">
<h3 id="org0cbf2d1"><span class="section-number-3">3.1</span> 方法</h3>
<div class="outline-text-3" id="text-3-1">
<dl class="org-dl">
<dt>int.bit_length()</dt><dd>返回整数的二进制长度。</dd>

<dt>int.to_bytes(length, byteorder, *, signed=False)</dt><dd>(<code>Python3</code>) 返回表示整数的字节数组。
效果和 <code>hex(x)</code> 有点像， 但更高级</dd>

<dt>int.from_bytes(bytes, byteorder, *, signed=False)</dt><dd>(<code>Python3</code>) 返回给定字节数组所表示的整数。</dd>

<dt>float.as_integer_ratio()</dt><dd><p>
返回一对整数，其比例与原始浮点数完全相等，并带有一个正的分母。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span class="org-variable-name">x</span> = 3.3
&gt;&gt;&gt; x.as_integer_ratio()
(3715469692580659L, 1125899906842624L)
</pre>
</div></dd>

<dt>float.is_integer()</dt><dd>如果小数点后全是 <code>0</code>, 返回 <code>True</code>, 否则返回 <code>False</code></dd>

<dt>float.hex()</dt><dd>将浮点数的表示形式返回为十六进制字符串。</dd>

<dt>float.fromhex(s)</dt><dd><p>
返回由十六进制字符串 <code>s</code> 表示的 <code>float</code>.
</p>

<p>
字符串格式： <code>[sign] ['0x'] integer ['.' fraction] ['p' exponent]</code>
</p></dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-orgcaa0aa8" class="outline-2">
<h2 id="orgcaa0aa8"><span class="section-number-2">4</span> 序列类型</h2>
<div class="outline-text-2" id="text-4">
<p>
从这里开始， <code>Python2</code> 和 <code>Python3</code> 的文档就存在明显的差异了。这里
采取 <code>Python3</code> 的类型划分。
</p>

<p>
序列类型有： <code>list</code>, <code>tuple</code>, <code>range</code>. 当然了， <code>Python2</code> 应该是 <code>xrange</code>.
</p>

<p>
其中， <code>tuple</code> 属于不可变序列类型， 即不能进行修改。
</p>

<p>
对于序列类型来说， 它们都拥有一定数量的方法， 具有一些很强大的功能。
</p>

<p>
比如对 <b>切片</b> 操作的支持， 可以说这些功能足够满足我们的基本需求。
</p>

<p>
鉴于各个类型的方法数量， 如果想要了解的话， 建议 <code>help(type)</code>. 这里就不多说了。
</p>

<p>
但是， 还是有几个地方需要注意以下：
</p>
<dl class="org-dl">
<dt>sort(*, key=None, reverse=False)</dt><dd><p>
<code>Python2</code> 还有一个 <code>cmp</code> 参数， 这个参数
在 <code>Python3</code> 已经被废除了， 可以的话， 就不用 <code>cmp</code> 参数了。
</p>

<p>
另外， <code>sort()</code> 是没有返回值的， 如果想当然的希望 <code>list.sort()</code> 返回排序后的列表
的话， 你将得到一个 <code>None</code>. 
</p>

<p>
对此， 建议使用内置函数 <code>sorted</code>.
</p></dd>

<dt>切片</dt><dd>可以通过切片来转置序列， <code>x[::-1]</code> 即可。以前我是 <code>x[-1::-1]</code> 这样操作的&#x2026;&#x2026;</dd>
</dl>
</div>
</div>

<div id="outline-container-org84934f7" class="outline-2">
<h2 id="org84934f7"><span class="section-number-2">5</span> 文本序列类型</h2>
<div class="outline-text-2" id="text-5">
<p>
万恶之源 <code>str</code>. <code>Python2</code> 和 <code>Python3</code> 的不兼容相当难受。
</p>

<p>
但是， 依然需要记清楚：
</p>
<ul class="org-ul">
<li><code>Python2 str</code> 是 <code>bytes</code></li>
<li><code>Python3 str</code> 是 <code>unicode</code></li>
</ul>

<p>
除此之外， <code>bytes</code> 和 <code>str</code> 的方法基本相同。
</p>

<p>
但是需要注意的一点： 由于在 <code>Python2</code> 中同时操作 <code>unicode</code> 和 <code>bytes</code> 会对
<code>bytes</code> 进行隐式的 <code>decode</code> 操作。 这就导致当字符串只存在 <code>ASCII</code> 字符时，
<code>Python2</code> 中的字符串就像同时存在 <code>encode</code> 和 <code>decode</code> 的方法一样。 但是这只是
<code>Python2</code> 自动帮你完成了 <code>decode</code> 的操作。
</p>

<p>
而 <code>Python3</code> 中是不允许同时操作 <code>unicode</code> 和 <code>bytes</code> 的， 所以， 要明白：
</p>
<ul class="org-ul">
<li><code>bytes</code> 有 <code>decode</code> 方法</li>
<li><code>unicode</code> 有 <code>encode</code> 方法</li>
</ul>
</div>
</div>

<div id="outline-container-org039ba22" class="outline-2">
<h2 id="org039ba22"><span class="section-number-2">6</span> 集合类型</h2>
<div class="outline-text-2" id="text-6">
<p>
<code>Python</code> 中的集合类型有 <code>set</code> 和 <code>frozenset</code> 两种。
</p>

<p>
其中， <code>frozenset</code> 是 <code>set</code> 的不可变类型。
</p>

<p>
对于 <code>set</code>, 我觉的用代码来说明是最合适的：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">&#23450;&#20041; set</span>
&gt;&gt;&gt; <span class="org-variable-name">x</span> = <span class="org-builtin">set</span>([1,2,2,3,4,5,5,6])
&gt;&gt;&gt; <span class="org-variable-name">y</span> = {1, 2, 3, 7, 9, 10}


<span class="org-comment-delimiter"># </span><span class="org-comment">set &#20250;&#33258;&#21160;&#36807;&#28388;&#37325;&#22797;&#30340;&#20803;&#32032;</span>
&gt;&gt;&gt; x
<span class="org-builtin">set</span>([1, 2, 3, 4, 5, 6])
&gt;&gt;&gt; y
<span class="org-builtin">set</span>([1, 2, 3, 7, 9, 10])


<span class="org-comment-delimiter"># </span><span class="org-comment">&#38656;&#35201;&#27880;&#24847;&#30340;&#26159; {} &#26159; dict &#32780;&#19981;&#26159; set, &#22914;&#26524;&#35201;&#21019;&#24314;&#31354; set &#24212;&#35813;&#20351;&#29992; set()</span>
&gt;&gt;&gt; <span class="org-variable-name">z</span> = {}
&gt;&gt;&gt; <span class="org-builtin">type</span>(z)
&lt;<span class="org-builtin">type</span> <span class="org-string">'dict'</span>&gt;


<span class="org-comment-delimiter"># </span><span class="org-comment">set &#25903;&#25345;&#24120;&#29992;&#30340;&#38598;&#21512;&#36816;&#31639;</span>
&gt;&gt;&gt; x &amp; y               <span class="org-comment-delimiter"># </span><span class="org-comment">&#20132;&#38598;</span>
<span class="org-builtin">set</span>([1, 2, 3])

&gt;&gt;&gt; x | y               <span class="org-comment-delimiter"># </span><span class="org-comment">&#24182;&#38598;</span>
<span class="org-builtin">set</span>([1, 2, 3, 4, 5, 6, 7, 9, 10])

&gt;&gt;&gt; x - y               <span class="org-comment-delimiter"># </span><span class="org-comment">&#24046;&#38598;</span>
<span class="org-builtin">set</span>([4, 5, 6])

&gt;&gt;&gt; x ^ y               <span class="org-comment-delimiter"># </span><span class="org-comment">&#23545;&#31216;&#24046;&#38598;</span>
<span class="org-builtin">set</span>([4, 5, 6, 7, 9, 10])
</pre>
</div>
</div>
</div>

<div id="outline-container-org3188c10" class="outline-2">
<h2 id="org3188c10"><span class="section-number-2">7</span> 映射类型</h2>
<div class="outline-text-2" id="text-7">
<p>
<code>Python</code> 的映射类型无疑是 <code>dict</code> 了。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span class="org-builtin">help</span>(<span class="org-builtin">dict</span>)
Help on <span class="org-keyword">class</span> <span class="org-type">dict</span> <span class="org-keyword">in</span> module __builtin__:

<span class="org-keyword">class</span> <span class="org-type">dict</span>(<span class="org-builtin">object</span>)
 |  <span class="org-builtin">dict</span>() -&gt; new empty dictionary
 |  <span class="org-builtin">dict</span>(mapping) -&gt; new dictionary initialized <span class="org-keyword">from</span> a mapping <span class="org-builtin">object</span><span class="org-string">'s</span>
<span class="org-string"> |      (key, value) pairs</span>
<span class="org-string"> |  dict(iterable) -&gt; new dictionary initialized as if via:</span>
<span class="org-string"> |      d = {}</span>
<span class="org-string"> |      for k, v in iterable:</span>
<span class="org-string"> |          d[k] = v</span>
<span class="org-string"> |  dict(**kwargs) -&gt; new dictionary initialized with the name=value pairs</span>
<span class="org-string"> |      in the keyword argument list.  For example:  dict(one=1, two=2)</span>
</pre>
</div>

<p>
对于 <code>dict</code>, <code>help</code> 已说明了一切 ！
</p>
</div>
</div>

<div id="outline-container-orge0d85d8" class="outline-2">
<h2 id="orge0d85d8"><span class="section-number-2">8</span> 参考链接</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="https://docs.python.org/3/library/stdtypes.html">Python3</a></li>
<li><a href="https://docs.python.org/2.7/library/stdtypes.html">Python2</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明：本作品采用<a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/">知识共享署名-非商业性使用 4.0 国际许可协议</a>进行许可
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
